"""Модуль содержит текст, который будет отправлять бот."""


WELCOME_TEXT_1 = (
    'Бот проекта «Окно в Европу» поможет вам настроить бесплатный VPN и начать пользоваться интернетом без блокировок и цензуры.\n\n'
    '🌎 Наши серверы находятся в Европе и обеспечивают высокую скорость соединения, а ваш доступ надежно защищен протоколом шифрования Shadowsocks.\n\n'
    '💁‍ Каждый пользователь получает бесплатные 25 Гб VPN-трафика в месяц — этого с лихвой хватает для чтения заблокированных СМИ, пользования социальными сетями и безопасной передачи данных.\n\n'
    '🤖 С помощью бота вы можете управлять своей подпиской, отслеживать расход трафика и связываться с чатом технической поддержки.\n\n'
)

WELCOME_TEXT_2 = 'Поехали?'


# def download_text():
#     download_text_1 = ("💫")
#     download_text_2 = (
#         "Вы находитесь в двух шагах от доступа в свободный интернет, для подключения к VPN выполните следующие действия:"
#     )
# 
#     download_text_3 = (
#         "1️⃣ Скачайте и установите бесплатное приложение <b>Outline</b>\n\n"
#         "Вы можете установить его на свой компьютер, телефон, планшет или на все устройства сразу.\n\n"
#         "Нажмите на кнопку автоматической загрузки или выберите версию для вашей операционной системы вручную (кнопка ниже)."
#     )
# 
#     download_text_4 = (
#         "2️⃣ Получите ключ доступа и добавьте его в Outline\n\n"
#         "Установили приложение? Тогда давайте разберемся с ключом доступа."
#     )
#     return {
#         'download_1': download_text_1,
#         'download_2': download_text_2,
#         'download_3': download_text_3,
#         'download_4': download_text_4
#     }